org/holymacs.org
#+TITLE: Holymacs
#+AUTHOR: MinasMazar
#+EMAIL: minasmazar@gmail.com
#+DATE: <2023-07-15 Sat>
#+STARTUP: show2levels
#+SETUPFILE: ../../templates/_header.org
#+OPTIONS: toc:t

* Specs

It's a literate configuration but I'm not good at writing, this means that it will not be so literate in the end 😂 If you're reading this and you're new to the emacs world I recommend to view this document using Emacs: if you're reading the =org= version (from source repository) or from the internet using the Emacs browser =eww=, you can ~C-h o~ (or ~C-h p~ for packages) to have more information from Emacs documentation.

** COMMENT Main principles:

....

- when adding a feature, try to add some fast keybinding to access it (the /super/ key is often a good choice)

* Holymacs
:PROPERTIES:
:header-args: :tangle ~/.emacs.d/init.el
:END:

** Package Manager

#+begin_src elisp
  (add-to-list 'load-path "~/.emacs.d/vendor/") ; that's your sandbox
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("elpa" . "https://elpa.gnu.org/packages/")
			   ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

  (require 'use-package)
  (require 'use-package-ensure)
  (setq use-package-always-ensure t
	package-enable-at-startup t)
  (package-initialize)
#+end_src
** Main configuration
*** User data

Remember to set your name and email address! Place here your real data, or use the standard Emacs customization =(customize-variable 'user-full-name)=.

#+begin_example emacs-lisp
  (setq user-full-name "Your username"
        user-mail-address "username@domain.net")
#+end_example

*** Tab key, backup files and enabled major modes
#+begin_src elisp
  (setq tab-always-indent 'complete
	enable-recursive-minibuffers t
	make-backup-files nil)
#+end_src

Just ~C-h o~ over those functions for more information.

#+begin_src elisp
  (ffap-bindings)
  (savehist-mode 1)
  (recentf-mode 1)
#+end_src

*** Bookmarks
**** eww-bookmark-jump

Here add a custom bookmark handler relying on =browse-url= and =browse-url-handlers=, so even if we store a bookmark via =eww=, we're going to use the proper browser when opening it.

#+begin_src emacs-lisp
  (defun browse-url-bookmark-jump (bookmark)
    "Bookmark jump handler: relies on =browse-url-handler= to pick the right browser.
    Define a custom jumper avoid to open always on EWW in case the bookmark was placed with it"
    (browse-url (bookmark-prop-get bookmark 'location)))
  (require 'eww)
  (defalias #'eww-bookmark-jump #'browse-url-bookmark-jump)
#+end_src

*** Dired

#+begin_src elisp
  (require 'dired)
  (setq make-backup-files nil
	tab-always-indent 'complete
	dired-dwim-target t
	dired-listing-switches "-alth"
	dired-omit-files "\\`[.]?#\\|\\`[.][.]?")
  (define-key dired-mode-map (kbd "W") #'wdired-change-to-wdired-mode)
  (define-key dired-mode-map (kbd "H") #'dired-omit-mode)
  (define-key dired-mode-map (kbd "M-p") (lambda () (interactive) (dired-previous-line 1) (dired-display-file)))
  (define-key dired-mode-map (kbd "M-n") (lambda () (interactive) (dired-next-line 1) (dired-display-file)))
  (add-hook 'dired-mode-hook #'dired-hide-details-mode)
  (add-hook 'dired-mode-hook #'dired-omit-mode)
#+end_src

*** Appearance

#+begin_src elisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq ring-bell-function 'ignore
	visible-bell t)
#+end_src

*** Window and Tabs management

No configuration till now. If you want to learn something about this topic there [[https://karthinks.com/software/emacs-window-management-almanac/][this fantastic article]], or place the cursor on the function and ~C-h o~.

#+begin_src elisp
  (winner-mode 1)
#+end_src

#+begin_src elisp
  (defun holymacs-new-tab (name)
    "Create a new tab with NAME. When called interactively asks for the name in the minibuffer."
    (interactive "MTab: ")
    (tab-new)
    (tab-rename name))

  (global-set-key (kbd "M-o w") #'holymacs-new-tab)
#+end_src

*** Orderless
#+begin_src elisp
  (use-package orderless
    :custom
    (completion-styles '(orderless partial-completion)))
#+end_src

*** Minibuffer and Completion framework
