holymacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Holymacs</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Holymacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf3323eb">Specs</a></li>
<li><a href="#org8ea2269">Holymacs</a>
<ul>
<li><a href="#org740abc9">Package Manager</a></li>
<li><a href="#orgf24503e">Main configuration</a>
<ul>
<li><a href="#orge87fee3">User data</a></li>
<li><a href="#org3c3ca81">Tab key, backup files and enabled major modes</a></li>
<li><a href="#org6c2f3f7">Bookmarks</a></li>
<li><a href="#orgc2dbfe8">Dired</a></li>
<li><a href="#org12bcb19">Appearance</a></li>
<li><a href="#org9334547">Window and Tabs management</a></li>
<li><a href="#orga167078">Orderless</a></li>
<li><a href="#org30d6d41">Minibuffer and Completion framework</a></li>
<li><a href="#org4e95d58">Auto-completion</a></li>
<li><a href="#orgcf0c388">Embark</a></li>
<li><a href="#orgcc0b22f">Eshell</a></li>
<li><a href="#org1287432">Projects</a></li>
<li><a href="#orgd1468dd">Keybindings</a></li>
</ul>
</li>
<li><a href="#org61adc6e">Shared configuration</a></li>
<li><a href="#org4d73808">Modules</a>
<ul>
<li><a href="#orgdb719e4">Compilation and loading</a></li>
<li><a href="#org7b715a8">Helpers (🔬experimental)</a></li>
<li><a href="#orgbfd9759">Blorg</a></li>
<li><a href="#org3f97108">jarvis.el</a></li>
<li><a href="#org4fe7d31">IDE</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgea62027">On hand documentation</a>
<ul>
<li>
<ul>
<li><a href="#org7938068">Other Commands, functions and variables</a></li>
<li><a href="#orgf5e008e">String and Symbols</a></li>
<li><a href="#orgbfcdbc5">Macros</a></li>
<li><a href="#org52f8233">Vectors</a></li>
<li><a href="#orgcf51af5">Handle List</a></li>
<li><a href="#org294905d">(interactive) functions</a></li>
<li><a href="#org225ad48">Regular Expression Syntax (regexp)</a></li>
<li><a href="#orgf1bc37b">Timers</a></li>
<li><a href="#orgcd812c7">Insert colorize text programmatically</a></li>
<li><a href="#org9ffa7a4">Buffer management</a></li>
<li><a href="#org390c50f">Faces and fonts</a></li>
<li><a href="#orge41ef85">Libaries</a></li>
<li><a href="#orgefb3715">Useful topics</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org969388d">Credits</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3323eb" class="outline-2">
<h2 id="orgf3323eb">Specs</h2>
<div class="outline-text-2" id="text-orgf3323eb">
<p>
It's a literate configuration but I'm not good at writing, this means that it will not be so literate in the end 😂 If you're reading this and you're new to the emacs world I recommend to view this document using Emacs: if you're reading the <code>org</code> version (from source repository) or from the internet using the Emacs browser <code>eww</code>, you can <code>C-h o</code> (or <code>C-h p</code> for packages) to have more information from Emacs documentation.
</p>
</div>
</div>
<div id="outline-container-org8ea2269" class="outline-2">
<h2 id="org8ea2269">Holymacs</h2>
<div class="outline-text-2" id="text-org8ea2269">
</div>
<div id="outline-container-org740abc9" class="outline-3">
<h3 id="org740abc9">Package Manager</h3>
<div class="outline-text-3" id="text-org740abc9">
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'load-path <span style="color: #af9fff;">"~/.emacs.d/vendor/"</span>) <span style="color: #b7a07f; font-style: italic;">; </span><span style="color: #b7a07f; font-style: italic;">that's your sandbox</span>
(<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">package</span>)

(<span style="color: #00c089; font-weight: bold;">setq</span> package-archives '((<span style="color: #af9fff;">"melpa"</span> . <span style="color: #af9fff;">"https://melpa.org/packages/"</span>)
                           (<span style="color: #af9fff;">"elpa"</span> . <span style="color: #af9fff;">"https://elpa.gnu.org/packages/"</span>)
                           (<span style="color: #af9fff;">"nongnu"</span> . <span style="color: #af9fff;">"https://elpa.nongnu.org/nongnu/"</span>)))

(<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">use-package</span>)
(<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">use-package-ensure</span>)
(<span style="color: #00c089; font-weight: bold;">setq</span> use-package-always-ensure t
        package-enable-at-startup t)
(package-initialize)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf24503e" class="outline-3">
<h3 id="orgf24503e">Main configuration</h3>
<div class="outline-text-3" id="text-orgf24503e">
</div>
<div id="outline-container-orge87fee3" class="outline-4">
<h4 id="orge87fee3">User data</h4>
<div class="outline-text-4" id="text-orge87fee3">
<p>
Remember to set your name and email address! Place here your real data, or use the standard Emacs customization <code>(customize-variable 'user-full-name)</code>.
</p>

<pre class="example" id="orgc299dee">
(setq user-full-name "Your username"
      user-mail-address "username@domain.net")
</pre>
</div>
</div>
<div id="outline-container-org3c3ca81" class="outline-4">
<h4 id="org3c3ca81">Tab key, backup files and enabled major modes</h4>
<div class="outline-text-4" id="text-org3c3ca81">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">setq</span> tab-always-indent 'complete
        enable-recursive-minibuffers t
        make-backup-files nil)
</pre>
</div>

<p>
Just <code>C-h o</code> over those functions for more information.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(ffap-bindings)
(savehist-mode 1)
(recentf-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6c2f3f7" class="outline-4">
<h4 id="org6c2f3f7">Bookmarks</h4>
<div class="outline-text-4" id="text-org6c2f3f7">
</div>
<ul class="org-ul">
<li><a id="orgaa8f9c9"></a>eww-bookmark-jump<br />
<div class="outline-text-5" id="text-orgaa8f9c9">
<p>
Here add a custom bookmark handler relying on <code>browse-url</code> and <code>browse-url-handlers</code>, so even if we store a bookmark via <code>eww</code>, we're going to use the proper browser when opening it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">browse-url-bookmark-jump</span> (bookmark)
  <span style="color: #7fc07f; font-style: italic;">"Bookmark jump handler: relies on =browse-url-handler= to pick the right browser.</span>
<span style="color: #7fc07f; font-style: italic;">  Define a custom jumper avoid to open always on EWW in case the bookmark was placed with it"</span>
  (browse-url (bookmark-prop-get bookmark 'location)))
(<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">eww</span>)
(<span style="color: #00c089; font-weight: bold;">defalias</span> #'eww-bookmark-jump #'browse-url-bookmark-jump)
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgc2dbfe8" class="outline-4">
<h4 id="orgc2dbfe8">Dired</h4>
<div class="outline-text-4" id="text-orgc2dbfe8">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">dired</span>)
(<span style="color: #00c089; font-weight: bold;">setq</span> make-backup-files nil
        tab-always-indent 'complete
        dired-dwim-target t
        dired-listing-switches <span style="color: #af9fff;">"-alth"</span>
        dired-omit-files <span style="color: #af9fff;">"\\`[.]?#</span><span style="color: #cfc04f;">\\</span><span style="color: #3fb83f;">|</span><span style="color: #af9fff;">\\`[.][.]?"</span>)
(define-key dired-mode-map (kbd <span style="color: #af9fff;">"W"</span>) #'wdired-change-to-wdired-mode)
(define-key dired-mode-map (kbd <span style="color: #af9fff;">"H"</span>) #'dired-omit-mode)
(define-key dired-mode-map (kbd <span style="color: #af9fff;">"M-p"</span>) (<span style="color: #00c089; font-weight: bold;">lambda</span> () (<span style="color: #00c089; font-weight: bold;">interactive</span>) (dired-previous-line 1) (dired-display-file)))
(define-key dired-mode-map (kbd <span style="color: #af9fff;">"M-n"</span>) (<span style="color: #00c089; font-weight: bold;">lambda</span> () (<span style="color: #00c089; font-weight: bold;">interactive</span>) (dired-next-line 1) (dired-display-file)))
(add-hook 'dired-mode-hook #'dired-hide-details-mode)
(add-hook 'dired-mode-hook #'dired-omit-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-org12bcb19" class="outline-4">
<h4 id="org12bcb19">Appearance</h4>
<div class="outline-text-4" id="text-org12bcb19">
<div class="org-src-container">
<pre class="src src-elisp">(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(<span style="color: #00c089; font-weight: bold;">setq</span> ring-bell-function 'ignore
        visible-bell t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9334547" class="outline-4">
<h4 id="org9334547">Window and Tabs management</h4>
<div class="outline-text-4" id="text-org9334547">
<p>
No configuration till now. If you want to learn something about this topic there <a href="https://karthinks.com/software/emacs-window-management-almanac/">this fantastic article</a>, or place the cursor on the function and <code>C-h o</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(winner-mode 1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">holymacs-new-tab</span> (name)
  <span style="color: #7fc07f; font-style: italic;">"Create a new tab with NAME. When called interactively asks for the name in the minibuffer."</span>
  (<span style="color: #00c089; font-weight: bold;">interactive</span> <span style="color: #af9fff;">"MTab: "</span>)
  (tab-new)
  (tab-rename name))

(global-set-key (kbd <span style="color: #af9fff;">"M-o w"</span>) #'holymacs-new-tab)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga167078" class="outline-4">
<h4 id="orga167078">Orderless</h4>
<div class="outline-text-4" id="text-orga167078">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> orderless
  <span style="color: #3fb83f; font-weight: bold;">:custom</span>
  (completion-styles '(orderless partial-completion)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org30d6d41" class="outline-4">
<h4 id="org30d6d41">Minibuffer and Completion framework</h4>
<div class="outline-text-4" id="text-org30d6d41">
</div>
<ul class="org-ul">
