org/holymacs.org
**** Minibuffer

#+begin_src elisp
  (setq enable-recursive-minibuffers t)
  (add-hook 'minibuffer-setup-hook (lambda () (local-set-key (kbd "C-o") #'switch-to-completions)))
  (define-key completion-list-mode-map (kbd "e") #'switch-to-minibuffer)
#+end_src

**** Vertico

#+begin_src elisp
  (use-package vertico
    :init
    (vertico-mode t)
    (setq vertico-count 10
	  vertico-resize t
	  vertico-cycle t))
#+end_src

*** Auto-completion

#+begin_src elisp
  (use-package corfu
    :hook
    (eshell-mode . (lambda ()
		     (setq-local corfu-auto nil)
		     (corfu-mode)))
    :custom
    (corfu-cycle t)
    :config
    (global-corfu-mode))
#+end_src

#+begin_src elisp
  (use-package cape
    :init
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-elisp-block)
    (add-hook 'completion-at-point-functions #'cape-history)
    ;;(add-hook 'completion-at-point-functions #'cape-keyword)
    ;;(add-hook 'completion-at-point-functions #'cape-tex)
    ;;(add-hook 'completion-at-point-functions #'cape-sgml)
    ;;(add-hook 'completion-at-point-functions #'cape-rfc1345)
    (add-hook 'completion-at-point-functions #'cape-abbrev)
    (add-hook 'completion-at-point-functions #'cape-dict)
    (add-hook 'completion-at-point-functions #'cape-elisp-symbol)
    (add-hook 'completion-at-point-functions #'cape-line))
#+end_src
*** Embark

#+begin_src elisp
  (use-package embark
    :config
    (add-to-list 'god-exempt-major-modes 'embark-mode)
    :bind*
    ("C-," . embark-act)
    (:map embark-general-map
	  ("C-w" . browse-url))
    (:map embark-identifier-map
	  ("R" . query-replace)
	  ("O" . multi-occur-in-matching-buffers)
	  ("c" . browse-url-chrome)
	  ("f" . browse-url-firefox))
    (:map embark-url-map
	  ("c" . browse-url-chrome)
	  ("f" . browse-url-firefox))
    (:map  embark-file-map
	   ("p" . project-find-file)
	   ("b" . project-switch-to-buffer)
	   ("," . append-to-previous-buffer)))
#+end_src

*** Eshell

#+begin_src elisp :tangle no
  (add-to-list 'org-babel-load-languages '(eshell . t))
  (add-hook 'eshell-mode-hook (lambda () (define-key eshell-mode-map (kbd "C-o") #'kill-this-buffer)))
#+end_src

*** Projects

#+begin_src elisp
  (require 'project)
  (add-to-list 'project-switch-commands '(project-shell "Shell"))
#+end_src

*** Keybindings
**** Custom keybindings

In vanilla Emacs the ~M-o~ keybinding is free: I'll use it as sort of an entrypoint for commands I often use, as for =org= commands. I'll use ~M-o M-o~ to map major-mode related commands.

#+begin_src elisp
  (global-set-key (kbd "M-o a") #'org-agenda)
  (global-set-key (kbd "M-o k") #'org-capture)
  (global-set-key (kbd "M-o 8") #'emoji-search)
  (global-set-key (kbd "M-o e") #'eshell)
  (global-set-key (kbd "M-o E") #'project-eshell)
  (global-set-key (kbd "M-o h") #'info-display-manual)
#+end_src

#+begin_src elisp
  (define-key dired-mode-map (kbd "M-o M-o h") #'dired-omit-mode)
#+end_src

**** For not graphical client (i.e. emacs -nw)

Sometimes when you run Emacs in old terminal emulators, you don't have access to the ~alt~ or ~super~ key. For this reason I redefine important Emacs standard keybindings to ~M-x~ and the =god-mode= toggle.

#+begin_src emacs-lisp :tangle no
  (global-set-key (kbd "C-k") nil)
  (global-set-key (kbd "C-k") #'execute-extended-command)
  (global-set-key (kbd "C-l") nil)
  (global-set-key (kbd "C-l") 'god-local-mode)
#+end_src

#+RESULTS:
: god-local-mode

**** Ease isearch UX

Uses normal movements keys and =TAB= key to move through =isearch=.

#+begin_src emacs-lisp
  (define-key isearch-mode-map (kbd "C-p") 'isearch-repeat-backward)
  (define-key isearch-mode-map (kbd "C-n") 'isearch-repeat-forward)
  (define-key isearch-mode-map (kbd "<tab>") 'isearch-repeat-forward)
  (define-key isearch-mode-map (kbd "<S-tab>") 'isearch-repeat-backward)
#+end_src

**** Translations keys

#+begin_src elisp
  (define-key key-translation-map (kbd "s-k") (kbd "M-x"))
  (define-key key-translation-map (kbd "s-m") (kbd "C-x"))
  (define-key key-translation-map (kbd "s-M") (kbd "C-c"))
  (define-key key-translation-map (kbd "s-o") (kbd "M-o"))
  (define-key key-translation-map (kbd "s-O") (kbd "M-o M-o"))
#+end_src

