holymacs.html
<li><a id="orgd0edd2c"></a>Minibuffer<br />
<div class="outline-text-5" id="text-orgd0edd2c">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">setq</span> enable-recursive-minibuffers t)
(add-hook 'minibuffer-setup-hook (<span style="color: #00c089; font-weight: bold;">lambda</span> () (local-set-key (kbd <span style="color: #af9fff;">"C-o"</span>) #'switch-to-completions)))
(define-key completion-list-mode-map (kbd <span style="color: #af9fff;">"e"</span>) #'switch-to-minibuffer)
</pre>
</div>
</div>
</li>
<li><a id="org78d1f0e"></a>Vertico<br />
<div class="outline-text-5" id="text-org78d1f0e">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> vertico
  <span style="color: #3fb83f; font-weight: bold;">:init</span>
  (vertico-mode t)
  (<span style="color: #00c089; font-weight: bold;">setq</span> vertico-count 10
          vertico-resize t
          vertico-cycle t))
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org4e95d58" class="outline-4">
<h4 id="org4e95d58">Auto-completion</h4>
<div class="outline-text-4" id="text-org4e95d58">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> corfu
  <span style="color: #3fb83f; font-weight: bold;">:hook</span>
  (eshell-mode . (<span style="color: #00c089; font-weight: bold;">lambda</span> ()
                     (<span style="color: #00c089; font-weight: bold;">setq-local</span> corfu-auto nil)
                     (corfu-mode)))
  <span style="color: #3fb83f; font-weight: bold;">:custom</span>
  (corfu-cycle t)
  <span style="color: #3fb83f; font-weight: bold;">:init</span>
  (global-corfu-mode))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> cape
  <span style="color: #3fb83f; font-weight: bold;">:init</span>
  (add-hook 'completion-at-point-functions #'cape-dabbrev)
  (add-hook 'completion-at-point-functions #'cape-file)
  (add-hook 'completion-at-point-functions #'cape-elisp-block)
  (add-hook 'completion-at-point-functions #'cape-history)
  <span style="color: #b7a07f; font-style: italic;">;;</span><span style="color: #b7a07f; font-style: italic;">(add-hook 'completion-at-point-functions #'cape-keyword)</span>
  <span style="color: #b7a07f; font-style: italic;">;;</span><span style="color: #b7a07f; font-style: italic;">(add-hook 'completion-at-point-functions #'cape-tex)</span>
  <span style="color: #b7a07f; font-style: italic;">;;</span><span style="color: #b7a07f; font-style: italic;">(add-hook 'completion-at-point-functions #'cape-sgml)</span>
  <span style="color: #b7a07f; font-style: italic;">;;</span><span style="color: #b7a07f; font-style: italic;">(add-hook 'completion-at-point-functions #'cape-rfc1345)</span>
  (add-hook 'completion-at-point-functions #'cape-abbrev)
  (add-hook 'completion-at-point-functions #'cape-dict)
  (add-hook 'completion-at-point-functions #'cape-elisp-symbol)
  (add-hook 'completion-at-point-functions #'cape-line))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf0c388" class="outline-4">
<h4 id="orgcf0c388">Embark</h4>
<div class="outline-text-4" id="text-orgcf0c388">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> embark
  <span style="color: #3fb83f; font-weight: bold;">:config</span>
  (add-to-list 'god-exempt-major-modes 'embark-mode)
  <span style="color: #3fb83f; font-weight: bold;">:bind*</span>
  (<span style="color: #af9fff;">"C-,"</span> . embark-act)
  (<span style="color: #3fb83f; font-weight: bold;">:map</span> embark-general-map
          (<span style="color: #af9fff;">"C-w"</span> . browse-url))
  (<span style="color: #3fb83f; font-weight: bold;">:map</span> embark-identifier-map
          (<span style="color: #af9fff;">"R"</span> . query-replace)
          (<span style="color: #af9fff;">"O"</span> . multi-occur-in-matching-buffers)
          (<span style="color: #af9fff;">"c"</span> . browse-url-chrome)
          (<span style="color: #af9fff;">"f"</span> . browse-url-firefox))
  (<span style="color: #3fb83f; font-weight: bold;">:map</span> embark-url-map
          (<span style="color: #af9fff;">"c"</span> . browse-url-chrome)
          (<span style="color: #af9fff;">"f"</span> . browse-url-firefox))
  (<span style="color: #3fb83f; font-weight: bold;">:map</span>  embark-file-map
           (<span style="color: #af9fff;">"p"</span> . project-find-file)
           (<span style="color: #af9fff;">"b"</span> . project-switch-to-buffer)
           (<span style="color: #af9fff;">","</span> . append-to-previous-buffer)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc0b22f" class="outline-4">
<h4 id="orgcc0b22f">Eshell</h4>
<div class="outline-text-4" id="text-orgcc0b22f">
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'org-babel-load-languages '(eshell . t))
(add-hook 'eshell-mode-hook (<span style="color: #00c089; font-weight: bold;">lambda</span> () (define-key eshell-mode-map (kbd <span style="color: #af9fff;">"C-o"</span>) #'kill-this-buffer)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1287432" class="outline-4">
<h4 id="org1287432">Projects</h4>
<div class="outline-text-4" id="text-org1287432">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">require</span> '<span style="color: #37aff6;">project</span>)
(add-to-list 'project-switch-commands '(project-shell <span style="color: #af9fff;">"Shell"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd1468dd" class="outline-4">
<h4 id="orgd1468dd">Keybindings</h4>
<div class="outline-text-4" id="text-orgd1468dd">
</div>
<ul class="org-ul">
<li><a id="orgc40fbfd"></a>Custom keybindings<br />
<div class="outline-text-5" id="text-orgc40fbfd">
<p>
In vanilla Emacs the <code>M-o</code> keybinding is free: I'll use it as sort of an entrypoint for commands I often use, as for <code>org</code> commands. I'll use <code>M-o M-o</code> to map major-mode related commands.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd <span style="color: #af9fff;">"M-o a"</span>) #'org-agenda)
(global-set-key (kbd <span style="color: #af9fff;">"M-o k"</span>) #'org-capture)
(global-set-key (kbd <span style="color: #af9fff;">"M-o 8"</span>) #'emoji-search)
(global-set-key (kbd <span style="color: #af9fff;">"M-o e"</span>) #'eshell)
(global-set-key (kbd <span style="color: #af9fff;">"M-o E"</span>) #'project-eshell)
(global-set-key (kbd <span style="color: #af9fff;">"M-o h"</span>) #'info-display-manual)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(define-key dired-mode-map (kbd <span style="color: #af9fff;">"M-o M-o h"</span>) #'dired-omit-mode)
</pre>
</div>
</div>
</li>
<li><a id="org6e50c9e"></a>For not graphical client (i.e. emacs -nw)<br />
<div class="outline-text-5" id="text-org6e50c9e">
<p>
Sometimes when you run Emacs in old terminal emulators, you don't have access to the <code>alt</code> or <code>super</code> key. For this reason I redefine important Emacs standard keybindings to <code>M-x</code> and the <code>god-mode</code> toggle.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #af9fff;">"C-k"</span>) nil)
(global-set-key (kbd <span style="color: #af9fff;">"C-k"</span>) #'execute-extended-command)
(global-set-key (kbd <span style="color: #af9fff;">"C-l"</span>) nil)
(global-set-key (kbd <span style="color: #af9fff;">"C-l"</span>) 'god-local-mode)
</pre>
</div>
</div>
</li>
<li><a id="org80f50d8"></a>Ease isearch UX<br />
<div class="outline-text-5" id="text-org80f50d8">
<p>
Uses normal movements keys and <code>TAB</code> key to move through <code>isearch</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key isearch-mode-map (kbd <span style="color: #af9fff;">"C-p"</span>) 'isearch-repeat-backward)
(define-key isearch-mode-map (kbd <span style="color: #af9fff;">"C-n"</span>) 'isearch-repeat-forward)
(define-key isearch-mode-map (kbd <span style="color: #af9fff;">"&lt;tab&gt;"</span>) 'isearch-repeat-forward)
(define-key isearch-mode-map (kbd <span style="color: #af9fff;">"&lt;S-tab&gt;"</span>) 'isearch-repeat-backward)
</pre>
</div>
</div>
</li>
<li><a id="orgcd48b6f"></a>Translations keys<br />
<div class="outline-text-5" id="text-orgcd48b6f">
<div class="org-src-container">
<pre class="src src-elisp">(define-key key-translation-map (kbd <span style="color: #af9fff;">"s-k"</span>) (kbd <span style="color: #af9fff;">"M-x"</span>))
(define-key key-translation-map (kbd <span style="color: #af9fff;">"s-m"</span>) (kbd <span style="color: #af9fff;">"C-x"</span>))
(define-key key-translation-map (kbd <span style="color: #af9fff;">"s-M"</span>) (kbd <span style="color: #af9fff;">"C-c"</span>))
(define-key key-translation-map (kbd <span style="color: #af9fff;">"s-o"</span>) (kbd <span style="color: #af9fff;">"M-o"</span>))
(define-key key-translation-map (kbd <span style="color: #af9fff;">"s-O"</span>) (kbd <span style="color: #af9fff;">"M-o M-o"</span>))
</pre>
</div>
</div>
</li>
