org/holymacs.org
**** Super-key

#+begin_src elisp
  (global-set-key (kbd "s-0") (kbd "C-x 0"))
  (global-set-key (kbd "s-1") (kbd "C-x 1"))
  (global-set-key (kbd "s-2") (kbd "C-x 2"))
  (global-set-key (kbd "s-3") (kbd "C-x 3"))
  (global-set-key (kbd "s-w") (kbd "C-x o"))
  (global-set-key (kbd "s-r") (kbd "C-x z"))
  (global-set-key (kbd "s-i") (kbd "C-M-i"))
  (global-set-key (kbd "s-N") (kbd "C-x C-j"))
  (global-set-key (kbd "s-[") (kbd "C-x <left>"))
  (global-set-key (kbd "s-]") (kbd "C-x <right>"))
  (global-set-key (kbd "s-,") #'switch-to-completions) ;; useful if you don't use ido, vertico or similar
  (global-set-key (kbd "s-b") #'ibuffer)
  (global-set-key (kbd "s-j") #'switch-to-buffer)
  (global-set-key (kbd "s-)") #'kill-current-buffer)
  (global-set-key (kbd "s--") #'bookmark-jump)
  (global-set-key (kbd "s-_") #'bookmark-set)
  (global-set-key (kbd "s-q") #'tab-next)
  (global-set-key (kbd "s-\\") #'other-frame)
  (global-set-key (kbd "s-t") #'find-name-dired)
  (global-set-key (kbd "s-e") #'dabbrev-expand)
  (global-set-key (kbd "s-r") #'repeat)
  (global-set-key (kbd "s-u") #'revert-buffer)
  (global-set-key (kbd "s-p") #'project-switch-to-buffer)
  (global-set-key (kbd "s-P") #'project-find-file)
#+end_src

**** God mode

#+begin_src elisp
  (use-package god-mode
    :config
    (defun minemacs-god-mode-disabled ()
      (setq cursor-type 'bar))

    (defun minemacs-god-mode-enabled ()
      (setq cursor-type 'box))

    (add-hook 'god-mode-enabled-hook 'minemacs-god-mode-enabled)
    (add-hook 'god-mode-disabled-hook 'minemacs-god-mode-disabled)
    (global-set-key (kbd "s-n") #'god-local-mode)
    (define-key god-local-mode-map (kbd "i") #'god-local-mode)
    (define-key god-local-mode-map (kbd "u") #'undo)
    (define-key god-local-mode-map (kbd "U") #'undo-redo)
    (define-key god-local-mode-map (kbd ">") #'end-of-buffer)
    (define-key god-local-mode-map (kbd "<") #'beginning-of-buffer)
    (define-key god-local-mode-map (kbd "[") #'backward-paragraph)
    (define-key god-local-mode-map (kbd "]") #'forward-paragraph)
    (define-key god-local-mode-map (kbd "{") #'backward-sexp)
    (define-key god-local-mode-map (kbd "}") #'forward-sexp)
    (mapcar (lambda (exempted-major-mode)
  	    (add-to-list 'god-exempt-major-modes exempted-major-mode))
  	  '(compilation-mode
  	    org-capture-mode
  	    org-agenda-mode
  	    elfeed-search-mode
  	    elfeed-show-mode))
    (god-mode))
#+end_src

**** which-key

#+begin_src elisp
  (use-package which-key
    :config
    (which-key-mode)
    (which-key-enable-god-mode-support))
#+end_src

** Shared configuration

Here's I share my most used configuration files across systems by simply usiung a shared directory.

#+begin_src elisp
  (if (file-exists-p "~/Dropbox/emacs/")
      (setq bookmark-file "~/Dropbox/emacs/bookmarks"
	    eshell-aliases-file "~/Dropbox/emacs/eshell-aliases"
	    custom-file "~/.emacs.d/custom.el"
	    org-agenda-files '("~/Dropbox/org/")
	    org-roam-directory "~/Dropbox/org-roam/"))
  (load custom-file 'noerror)
#+end_src
** Modules
*** Compilation and loading

Re-tangle all modules. I don't think a specific command is needed, unless in the future I want to achieve something more complex. When you want to sync the literate files to the actual Emacs configuration, open this org file and eval the next code block (i.e. ~C-c~ if you're reading this in org-mode (experimenting with *eww* and auto-activate =org-mode=.

#+begin_src elisp
  (defun holymacs-compile ()
    "Babel-compile all '*.org' literate configuration files in './holymacs' to generate emacs modules files. Load them with 'holymacs-modules-load'"
    (interactive)
    (message "holymacs: compilation..")
    (mapcar #'org-babel-tangle-file
  	  (directory-files "holymacs" t "\\.org$" directory-files-no-dot-files-regexp)))
#+end_src

Here we define a mechanism to easily extend your Emacs experience with some custom defined /modules/, a set of packages and configuration that can be grouped for any reason (they're the equivalent of the *layers* in *Doom Emacs*), but I'm not creating a whole mechanism to handle this: just place an =.el= file in the =~/.emacs.d/modules/= directory, and it will be autoloaded.

#+begin_src elisp
  (defun holymacs-modules-load ()
    "Load all modules '*.el' files in './.emacs.d/modules/' babel-generated with 'holymacs-compile'"
    (interactive)
    (let* ((modules-dir (concat user-emacs-directory "modules/"))
  	 (modules (if (file-exists-p modules-dir)
  		      (directory-files modules-dir))))
      (if modules (mapcar (lambda (module)
  			  (load (concat modules-dir module) 'noerror))
  			modules))))
#+end_src

Load modules!

#+begin_src elisp
  (holymacs-modules-load)
#+end_src

