holymacs.html
<li><a id="orgf5b5d20"></a>Super-key<br />
<div class="outline-text-5" id="text-orgf5b5d20">
<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd <span style="color: #af9fff;">"s-0"</span>) (kbd <span style="color: #af9fff;">"C-x 0"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-1"</span>) (kbd <span style="color: #af9fff;">"C-x 1"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-2"</span>) (kbd <span style="color: #af9fff;">"C-x 2"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-3"</span>) (kbd <span style="color: #af9fff;">"C-x 3"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-w"</span>) (kbd <span style="color: #af9fff;">"C-x o"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-r"</span>) (kbd <span style="color: #af9fff;">"C-x z"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-i"</span>) (kbd <span style="color: #af9fff;">"C-M-i"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-N"</span>) (kbd <span style="color: #af9fff;">"C-x C-j"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-["</span>) (kbd <span style="color: #af9fff;">"C-x &lt;left&gt;"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-]"</span>) (kbd <span style="color: #af9fff;">"C-x &lt;right&gt;"</span>))
(global-set-key (kbd <span style="color: #af9fff;">"s-,"</span>) #'switch-to-completions) <span style="color: #b7a07f; font-style: italic;">;; </span><span style="color: #b7a07f; font-style: italic;">useful if you don't use ido, vertico or similar</span>
(global-set-key (kbd <span style="color: #af9fff;">"s-b"</span>) #'ibuffer)
(global-set-key (kbd <span style="color: #af9fff;">"s-j"</span>) #'switch-to-buffer)
(global-set-key (kbd <span style="color: #af9fff;">"s-)"</span>) #'kill-current-buffer)
(global-set-key (kbd <span style="color: #af9fff;">"s--"</span>) #'bookmark-jump)
(global-set-key (kbd <span style="color: #af9fff;">"s-_"</span>) #'bookmark-set)
(global-set-key (kbd <span style="color: #af9fff;">"s-q"</span>) #'tab-next)
(global-set-key (kbd <span style="color: #af9fff;">"s-\\"</span>) #'other-frame)
(global-set-key (kbd <span style="color: #af9fff;">"s-t"</span>) #'find-name-dired)
(global-set-key (kbd <span style="color: #af9fff;">"s-e"</span>) #'dabbrev-expand)
(global-set-key (kbd <span style="color: #af9fff;">"s-r"</span>) #'repeat)
(global-set-key (kbd <span style="color: #af9fff;">"s-u"</span>) #'revert-buffer)
(global-set-key (kbd <span style="color: #af9fff;">"s-p"</span>) #'project-switch-to-buffer)
(global-set-key (kbd <span style="color: #af9fff;">"s-P"</span>) #'project-find-file)
</pre>
</div>
</div>
</li>
<li><a id="org707b115"></a>God mode<br />
<div class="outline-text-5" id="text-org707b115">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> god-mode
  <span style="color: #3fb83f; font-weight: bold;">:config</span>
  (<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">minemacs-god-mode-disabled</span> ()
    (<span style="color: #00c089; font-weight: bold;">setq</span> cursor-type 'bar))

  (<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">minemacs-god-mode-enabled</span> ()
    (<span style="color: #00c089; font-weight: bold;">setq</span> cursor-type 'box))

  (add-hook 'god-mode-enabled-hook 'minemacs-god-mode-enabled)
  (add-hook 'god-mode-disabled-hook 'minemacs-god-mode-disabled)
  (global-set-key (kbd <span style="color: #af9fff;">"s-n"</span>) #'god-local-mode)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"i"</span>) #'god-local-mode)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"u"</span>) #'undo)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"U"</span>) #'undo-redo)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"&gt;"</span>) #'end-of-buffer)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"&lt;"</span>) #'beginning-of-buffer)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"["</span>) #'backward-paragraph)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"]"</span>) #'forward-paragraph)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"{"</span>) #'backward-sexp)
  (define-key god-local-mode-map (kbd <span style="color: #af9fff;">"}"</span>) #'forward-sexp)
  (mapcar (<span style="color: #00c089; font-weight: bold;">lambda</span> (exempted-major-mode)
            (add-to-list 'god-exempt-major-modes exempted-major-mode))
          '(compilation-mode
            org-capture-mode
            org-agenda-mode
            elfeed-search-mode
            elfeed-show-mode))
  (god-mode))
</pre>
</div>
</div>
</li>
<li><a id="orge46cea0"></a>which-key<br />
<div class="outline-text-5" id="text-orge46cea0">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">use-package</span> which-key
  <span style="color: #3fb83f; font-weight: bold;">:config</span>
  (which-key-mode)
  (which-key-enable-god-mode-support))
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org61adc6e" class="outline-3">
<h3 id="org61adc6e">Shared configuration</h3>
<div class="outline-text-3" id="text-org61adc6e">
<p>
Here's I share my most used configuration files across systems by simply usiung a shared directory.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">if</span> (file-exists-p <span style="color: #af9fff;">"~/Dropbox/emacs/"</span>)
    (<span style="color: #00c089; font-weight: bold;">setq</span> bookmark-file <span style="color: #af9fff;">"~/Dropbox/emacs/bookmarks"</span>
            eshell-aliases-file <span style="color: #af9fff;">"~/Dropbox/emacs/eshell-aliases"</span>
            custom-file <span style="color: #af9fff;">"~/.emacs.d/custom.el"</span>
            org-agenda-files '(<span style="color: #af9fff;">"~/Dropbox/org/"</span>)
            org-roam-directory <span style="color: #af9fff;">"~/Dropbox/org-roam/"</span>))
(load custom-file 'noerror)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4d73808" class="outline-3">
<h3 id="org4d73808">Modules</h3>
<div class="outline-text-3" id="text-org4d73808">
</div>
<div id="outline-container-orgdb719e4" class="outline-4">
<h4 id="orgdb719e4">Compilation and loading</h4>
<div class="outline-text-4" id="text-orgdb719e4">
<p>
Re-tangle all modules. I don't think a specific command is needed, unless in the future I want to achieve something more complex. When you want to sync the literate files to the actual Emacs configuration, open this org file and eval the next code block (i.e. <code>C-c</code> if you're reading this in org-mode (experimenting with <b>eww</b> and auto-activate <code>org-mode</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">holymacs-compile</span> ()
  <span style="color: #7fc07f; font-style: italic;">"Babel-compile all '</span><span style="color: #37aff6; font-style: italic;">*.org</span><span style="color: #7fc07f; font-style: italic;">' literate configuration files in '</span><span style="color: #37aff6; font-style: italic;">./holymacs</span><span style="color: #7fc07f; font-style: italic;">' to generate emacs modules files. Load them with '</span><span style="color: #37aff6; font-style: italic;">holymacs-modules-load</span><span style="color: #7fc07f; font-style: italic;">'"</span>
  (<span style="color: #00c089; font-weight: bold;">interactive</span>)
  (message <span style="color: #af9fff;">"holymacs: compilation.."</span>)
  (mapcar #'org-babel-tangle-file
          (directory-files <span style="color: #af9fff;">"holymacs"</span> t <span style="color: #af9fff;">"\\.org$"</span> directory-files-no-dot-files-regexp)))
</pre>
</div>

<p>
Here we define a mechanism to easily extend your Emacs experience with some custom defined <i>modules</i>, a set of packages and configuration that can be grouped for any reason (they're the equivalent of the <b>layers</b> in <b>Doom Emacs</b>), but I'm not creating a whole mechanism to handle this: just place an <code>.el</code> file in the <code>~/.emacs.d/modules/</code> directory, and it will be autoloaded.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">holymacs-modules-load</span> ()
  <span style="color: #7fc07f; font-style: italic;">"Load all modules '</span><span style="color: #37aff6; font-style: italic;">*.el</span><span style="color: #7fc07f; font-style: italic;">' files in '</span><span style="color: #37aff6; font-style: italic;">./.emacs.d/modules/</span><span style="color: #7fc07f; font-style: italic;">' babel-generated with '</span><span style="color: #37aff6; font-style: italic;">holymacs-compile</span><span style="color: #7fc07f; font-style: italic;">'"</span>
  (<span style="color: #00c089; font-weight: bold;">interactive</span>)
  (<span style="color: #00c089; font-weight: bold;">let*</span> ((modules-dir (concat user-emacs-directory <span style="color: #af9fff;">"modules/"</span>))
         (modules (<span style="color: #00c089; font-weight: bold;">if</span> (file-exists-p modules-dir)
                      (directory-files modules-dir))))
    (<span style="color: #00c089; font-weight: bold;">if</span> modules (mapcar (<span style="color: #00c089; font-weight: bold;">lambda</span> (module)
                          (load (concat modules-dir module) 'noerror))
                        modules))))
</pre>
</div>

<p>
Load modules!
</p>

<div class="org-src-container">
<pre class="src src-elisp">(holymacs-modules-load)
</pre>
</div>
</div>
</div>
