org/holymacs.org
*** Helpers (🔬experimental)
#+begin_src elisp
  (defvar holymacs--private-data-pathname
    "~/Dropbox/emacs/private.el"
    "Holymacs store here some data; its purpose is to keep some data separate and almost secure.")

  (defmacro holymacs-with-private-data (&rest body)
    `(progn
       (load holymacs--private-data-pathname)
       ,@body))

  (defun holymacs-kill (name)
    (interactive "Bbuffer:")
    (when (get-buffer name)
      (progn
        (holymacs-inspect (format "killing %s" name))
        (kill-buffer name))))

  (defun holymacs-async (cmd &optional name)
    (interactive (list (read-from-minibuffer "Cmd: ")
    		     (read-from-minibuffer "buffer: " "*holymacs-aync*")))
    (holymacs-inspect cmd)
    (save-window-excursion
      (async-shell-command cmd name)))

  (defun holymacs-async (cmd &body)
    (holymacs-inspect cmd)
    (save-window-excursion
      (async-shell-command cmd "*holymacs-async*")))

  (defun holymacs-inspect (obj)
    (message (format "holymacs-inspect: %s" obj))
    obj)
#+end_src

#+RESULTS:
: holymacs-inspect

*** Blorg

The *Blorg* publishing functions described in [[https://github.com/MinasMazar/minasmazar.github.io/blob/master/README.org][README.org]] will tangle its code in the =blorg.el= module.

*** [[file:holymacs/jarvis.org][jarvis.el]]
*** [[file:holymacs/ide.org][IDE]]

* On hand documentation
*** Other Commands, functions and variables

Just press ~C-h o~ to get help on those symbols.

- =add-file-local-variable= (append at bottom of the file) and =add-file-local-variable-prop-line= (prepend in the first line)
- =align-regexp=
- =auto-mode-alist=
- =browse-url-of-buffer=
- =command-switch-alist=
- =completions-max-height=
- =compilation-scroll-output=
- =describe-text-properties=
- =face-remap-add-relative= and =face-remap-remove-relative= to easily modify faces in current buffer
- =find-name-dired=
- =image-crop=
- =imenu-generic-expression=
- =json-pretty-print-buffer=
- =mm-discouraged-alternatives=
- =org-agenda-include-diary=
- =org-agenda-custom-commands=
- =org-archive-subtree-default=
- =org-babel-load-file=
- =org-todo-keywords=
- =pp-eval-expression=
- =proced=
- =shr-inhibit-images=
- =string-match=

*** String and Symbols

#+begin_src elisp
(symbol-name 'some-symbol)
; => "some-symbol"
(intern "some-symbol")
; => some-symbol
#+end_src

*** Macros

#+begin_src elisp
  (defmacro ++ (x)
    (list 'setq x (list '1+ x)))
#+end_src

*** Vectors

Get an element from a vector

#+begin_example emacs-lisp
;; get a element from vector
(aref ["a" "b" "c"] 0) ; ⇒ "a"
;; get a element from vector
(elt ["a" "b" "c"] 0) ; ⇒ "a"
#+end_example

What's the difference between =aref= and =elt=?
=elt= is more general. It works on vector and list. But if you know
it's vector, you should use =aref=, because it's precise and faster.

*** Handle List

To find an element

- =member=
- =contains=
- =seq-find=

#+begin_example elisp
  (seq-find (lambda (val) (= 3 val)) '(1 2 3))
#+end_example

*** (interactive) functions

Refs to [[https://emacs.stackexchange.com/questions/32248/how-to-write-a-function-with-an-interactive-choice-of-the-value-of-the-argument][this SO post]] try [[elisp:(completing-read "Prompt: " '(i1 i2 i3))]] and [[https://emacsdocs.org/docs/elisp/Text-from-Minibuffer][this post]]; try [[elisp:(read-from-minibuffer "Prompt: " "initial")]]. Take a look at =minemacs/demo-function=, it can help if you want to write functions with bit more complex interactive prompts.

#+begin_example emacs-lisp
  (defun minemacs/demo-function (url &optional handler)
    "Example function."
    (interactive (list
		  (read-from-minibuffer "URL: ")
		  (completing-read "handler: " '(browse-url-firefox browse-url-chrome))))
     (message (format "url: %s, handler: %s" url handler )))
#+end_example

