holymacs.html
<div id="outline-container-org7b715a8" class="outline-4">
<h4 id="org7b715a8">Helpers (🔬experimental)</h4>
<div class="outline-text-4" id="text-org7b715a8">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">defvar</span> <span style="color: #78afff;">holymacs--private-data-pathname</span>
  <span style="color: #af9fff;">"~/Dropbox/emacs/private.el"</span>
  <span style="color: #7fc07f; font-style: italic;">"Holymacs store here some data; its purpose is to keep some data separate and almost secure."</span>)

(<span style="color: #00c089; font-weight: bold;">defmacro</span> <span style="color: #7fc500;">holymacs-with-private-data</span> (<span style="color: #7fcfdf;">&amp;rest</span> body)
  `(<span style="color: #00c089; font-weight: bold;">progn</span>
     (load holymacs--private-data-pathname)
     ,@body))

(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">holymacs-kill</span> (name)
  (<span style="color: #00c089; font-weight: bold;">interactive</span> <span style="color: #af9fff;">"Bbuffer:"</span>)
  (<span style="color: #00c089; font-weight: bold;">when</span> (get-buffer name)
    (<span style="color: #00c089; font-weight: bold;">progn</span>
      (holymacs-inspect (format <span style="color: #af9fff;">"killing %s"</span> name))
      (kill-buffer name))))

(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">holymacs-async</span> (cmd <span style="color: #7fcfdf;">&amp;optional</span> name)
  (<span style="color: #00c089; font-weight: bold;">interactive</span> (list (read-from-minibuffer <span style="color: #af9fff;">"Cmd: "</span>)
                     (read-from-minibuffer <span style="color: #af9fff;">"buffer: "</span> <span style="color: #af9fff;">"*holymacs-aync*"</span>)))
  (holymacs-inspect cmd)
  (<span style="color: #00c089; font-weight: bold;">save-window-excursion</span>
    (async-shell-command cmd name)))

(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">holymacs-async</span> (cmd <span style="color: #7fcfdf;">&amp;body</span>)
  (holymacs-inspect cmd)
  (<span style="color: #00c089; font-weight: bold;">save-window-excursion</span>
    (async-shell-command cmd <span style="color: #af9fff;">"*holymacs-async*"</span>)))

(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">holymacs-inspect</span> (obj)
  (message (format <span style="color: #af9fff;">"holymacs-inspect: %s"</span> obj))
  obj)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbfd9759" class="outline-4">
<h4 id="orgbfd9759">Blorg</h4>
<div class="outline-text-4" id="text-orgbfd9759">
<p>
The <b>Blorg</b> publishing functions described in <a href="https://github.com/MinasMazar/minasmazar.github.io/blob/master/README.org">README.org</a> will tangle its code in the <code>blorg.el</code> module.
</p>
</div>
</div>
<div id="outline-container-org3f97108" class="outline-4">
<h4 id="org3f97108"><a href="holymacs/jarvis.html">jarvis.el</a></h4>
</div>
<div id="outline-container-org4fe7d31" class="outline-4">
<h4 id="org4fe7d31"><a href="holymacs/ide.html">IDE</a></h4>
</div>
</div>
</div>
<div id="outline-container-orgea62027" class="outline-2">
<h2 id="orgea62027">On hand documentation</h2>
<div class="outline-text-2" id="text-orgea62027">
</div>
<div id="outline-container-org7938068" class="outline-4">
<h4 id="org7938068">Other Commands, functions and variables</h4>
<div class="outline-text-4" id="text-org7938068">
<p>
Just press <code>C-h o</code> to get help on those symbols.
</p>

<ul class="org-ul">
<li><code>add-file-local-variable</code> (append at bottom of the file) and <code>add-file-local-variable-prop-line</code> (prepend in the first line)</li>
<li><code>align-regexp</code></li>
<li><code>auto-mode-alist</code></li>
<li><code>browse-url-of-buffer</code></li>
<li><code>command-switch-alist</code></li>
<li><code>completions-max-height</code></li>
<li><code>describe-text-properties</code></li>
<li><code>face-remap-add-relative</code> and <code>face-remap-remove-relative</code> to easily modify faces in current buffer</li>
<li><code>find-name-dired</code></li>
<li><code>image-crop</code></li>
<li><code>imenu-generic-expression</code></li>
<li><code>json-pretty-print-buffer</code></li>
<li><code>mm-discouraged-alternatives</code></li>
<li><code>org-agenda-include-diary</code></li>
<li><code>org-agenda-custom-commands</code></li>
<li><code>org-archive-subtree-default</code></li>
<li><code>org-babel-load-file</code></li>
<li><code>org-todo-keywords</code></li>
<li><code>pp-eval-expression</code></li>
<li><code>proced</code></li>
<li><code>shr-inhibit-images</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgf5e008e" class="outline-4">
<h4 id="orgf5e008e">String and Symbols</h4>
<div class="outline-text-4" id="text-orgf5e008e">
<div class="org-src-container">
<pre class="src src-elisp">(symbol-name 'some-symbol)
<span style="color: #b7a07f; font-style: italic;">; </span><span style="color: #b7a07f; font-style: italic;">=&gt; "some-symbol"</span>
(intern <span style="color: #af9fff;">"some-symbol"</span>)
<span style="color: #b7a07f; font-style: italic;">; </span><span style="color: #b7a07f; font-style: italic;">=&gt; some-symbol</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbfcdbc5" class="outline-4">
<h4 id="orgbfcdbc5">Macros</h4>
<div class="outline-text-4" id="text-orgbfcdbc5">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">defmacro</span> <span style="color: #7fc500;">++</span> (x)
  (list 'setq x (list '1+ x)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org52f8233" class="outline-4">
<h4 id="org52f8233">Vectors</h4>
<div class="outline-text-4" id="text-org52f8233">
<p>
Get an element from a vector
</p>

<pre class="example" id="orgd251b5c">
;; get a element from vector
(aref ["a" "b" "c"] 0) ; ⇒ "a"
;; get a element from vector
(elt ["a" "b" "c"] 0) ; ⇒ "a"
</pre>

<p>
What's the difference between <code>aref</code> and <code>elt</code>?
<code>elt</code> is more general. It works on vector and list. But if you know
it's vector, you should use <code>aref</code>, because it's precise and faster.
</p>
</div>
</div>
<div id="outline-container-orgcf51af5" class="outline-4">
<h4 id="orgcf51af5">Handle List</h4>
<div class="outline-text-4" id="text-orgcf51af5">
<p>
To find an element
</p>

<ul class="org-ul">
<li><code>member</code></li>
<li><code>contains</code></li>
<li><code>seq-find</code></li>
</ul>

<pre class="example" id="org5990cda">
(seq-find (lambda (val) (= 3 val)) '(1 2 3))
</pre>
</div>
</div>
<div id="outline-container-org294905d" class="outline-4">
<h4 id="org294905d">(interactive) functions</h4>
<div class="outline-text-4" id="text-org294905d">
<p>
Refs to <a href="https://emacs.stackexchange.com/questions/32248/how-to-write-a-function-with-an-interactive-choice-of-the-value-of-the-argument">this SO post</a> try <a href="elisp:(completing-read%20%22Prompt:%20%22%20'(i1%20i2%20i3))">elisp:(completing-read%20%22Prompt:%20%22%20'(i1%20i2%20i3))</a> and <a href="https://emacsdocs.org/docs/elisp/Text-from-Minibuffer">this post</a>; try <a href="elisp:(read-from-minibuffer%20%22Prompt:%20%22%20%22initial%22)">elisp:(read-from-minibuffer%20%22Prompt:%20%22%20%22initial%22)</a>. Take a look at <code>minemacs/demo-function</code>, it can help if you want to write functions with bit more complex interactive prompts.
</p>

<pre class="example" id="org5f8d169">
(defun minemacs/demo-function (url &amp;optional handler)
  "Example function."
  (interactive (list
		  (read-from-minibuffer "URL: ")
		  (completing-read "handler: " '(browse-url-firefox browse-url-chrome))))
   (message (format "url: %s, handler: %s" url handler )))
</pre>
</div>
</div>
