holymacs.html
<div id="outline-container-org225ad48" class="outline-4">
<h4 id="org225ad48">Regular Expression Syntax (regexp)</h4>
<div class="outline-text-4" id="text-org225ad48">
<p>
You can use the wonderful tool <code>regexp-builder</code>.
</p>

<blockquote>
<p>
Here is the syntax used by Emacs for regular expressions. Any character matches itself, except for the list below.
</p>

<p>
The following characters are special : . * + ? ^ $ \ [
</p>

<p>
Between brackets [], the following are special : ] - ^
</p>

<p>
Many characters are special when they follow a backslash – see below.
</p>

<p>
.        any character (but newline)
</p>
<ul class="org-ul">
<li>previous character or group, repeated 0 or more time</li>
<li>previous character or group, repeated 1 or more time</li>
</ul>
<p>
  ?        previous character or group, repeated 0 or 1 time
  ^        start of line
  $        end of line
  [&#x2026;]    any character between brackets
  [^..]    any character not in the brackets
  [a-z]    any character between a and z
  \        prevents interpretation of following special char
  \|       or
  \w       word constituent
  \b       word boundary
  \sc      character with c syntax (e.g. \s- for whitespace char)
  \( \)    start\end of group
  \&lt; \&gt;    start\end of word
  \_&lt; \_&gt;  start\end of symbol
  \` \'    start\end of buffer\string
  \1       string matched by the first group
  \n       string matched by the nth group
  \{3\}    previous character or group, repeated 3 times
  \{3,\}   previous character or group, repeated 3 or more times
  \{3,6\}  previous character or group, repeated 3 to 6 times
  \=       match succeeds if it is located at point
*?, +?, and ?? are non-greedy versions of *, +, and ? – see NonGreedyRegexp. Also, \W, \B, and \Sc match any character that does not match \w, \b, and \sc.
</p>

<p>
Characters are organized by category. Use C-u C-x = to display the category of the character under the cursor.
</p>

<p>
  \ca      ascii character
  \Ca      non-ascii character (newline included)
  \cl      latin character
  \cg      greek character
Here are some syntax classes that can be used between brackets, e.g. [[:upper:]\|[:digit:]\.].
</p>

<p>
  [:digit:]  a digit, same as [0-9]
  [:alpha:]  a letter (an alphabetic character)
  [:alnum:]  a letter or adigit (an alphanumeric character ()
  [:upper:]  a letter in uppercase
  [:space:]  a whitespace character, as defined by the syntax table
  [:xdigit:] an hexadecimal digit
  [:cntrl:]  a control character
  [:ascii:]  an ascii character
Syntax classes:
</p>

<p>
\s-   whitespace character        \s/   character quote character
\sw   word constituent            \s$   paired delimiter
\s_   symbol constituent          \s'   expression prefix
\s.   punctuation character       \s&lt;   comment starter
\s(   open delimiter character    \s&gt;   comment ender
\s)   close delimiter character   \s!   generic comment delimiter
\s"   string quote character      \s|   generic string delimiter
\s\   escape character
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgf1bc37b" class="outline-4">
<h4 id="orgf1bc37b">Timers</h4>
<div class="outline-text-4" id="text-orgf1bc37b">
<p>
You can run specified function at specified time and with a specific timeout. Check out <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Timers.html">the doc</a> for more information.
</p>

<pre class="example" id="org3e92216">
(run-at-time "11 min" t #'elfeed-update)
</pre>

<blockquote>
<p>
The list-timers command lists all the currently active timers. There’s
only one command available in the buffer displayed: c
(timer-list-cancel) that will cancel the timer on the line under
point.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgcd812c7" class="outline-4">
<h4 id="orgcd812c7">Insert colorize text programmatically</h4>
<div class="outline-text-4" id="text-orgcd812c7">
<pre class="example" id="org86099ea">
(insert (propertize "Red Text" 'font-lock-face '(:foreground "red")))
</pre>
</div>
</div>
<div id="outline-container-org9ffa7a4" class="outline-4">
<h4 id="org9ffa7a4">Buffer management</h4>
<div class="outline-text-4" id="text-org9ffa7a4">
<p>
Code stolen from <a href="https://stackoverflow.com/questions/4886745/emacs-what-is-the-shortcut-key-to-clear-buffer">stackoverflow</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">minemacs-clear-buffer</span> ()
  <span style="color: #7fc07f; font-style: italic;">"clear whole buffer add contents to the kill ring"</span>
  (<span style="color: #00c089; font-weight: bold;">interactive</span>)
  (kill-region (point-min) (point-max)))

(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">minemacs-clear-buffer-permenantly</span> ()
  <span style="color: #7fc07f; font-style: italic;">"clear whole buffer, contents is not added to the kill ring"</span>
  (<span style="color: #00c089; font-weight: bold;">interactive</span>)
  (delete-region (point-min) (point-max)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org390c50f" class="outline-4">
<h4 id="org390c50f">Faces and fonts</h4>
<div class="outline-text-4" id="text-org390c50f">
<p>
If you'd like to have a smaller font on compialtion buffers
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-hook 'compilation-mode-hook (<span style="color: #00c089; font-weight: bold;">lambda</span> () (text-scale-decrease 1)))
</pre>
</div>

<p>
Useful function if you want to quick inspect the face under cursor
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00c089; font-weight: bold;">defun</span> <span style="color: #7fc500;">what-face</span> (pos)
  (<span style="color: #00c089; font-weight: bold;">interactive</span> <span style="color: #af9fff;">"d"</span>)
  (<span style="color: #00c089; font-weight: bold;">let</span> ((face (<span style="color: #00c089; font-weight: bold;">or</span> (get-char-property pos 'read-face-name)
                  (get-char-property pos 'face))))
    (<span style="color: #00c089; font-weight: bold;">if</span> face (message <span style="color: #af9fff;">"Face: %s"</span> face) (message <span style="color: #af9fff;">"No face at %d"</span> pos))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge41ef85" class="outline-4">
<h4 id="orge41ef85">Libaries</h4>
<div class="outline-text-4" id="text-orge41ef85">
<ul class="org-ul">
<li><a href="https://tkf.github.io/emacs-request/">request.el</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgefb3715" class="outline-4">
<h4 id="orgefb3715">Useful topics</h4>
<div class="outline-text-4" id="text-orgefb3715">
<ul class="org-ul">
<li><a href="https://orgmode.org/manual/Results-of-Evaluation.html">Results of Evaluation</a></li>
<li><p>
<a href="https://dev.to/rajasegar/5-ways-to-get-text-from-an-emacs-buffer-4c3l">5 ways to get text from an Emacs buffer</a>
</p>

<pre class="example" id="orgc0707da">
(let ((start (point-min))
	  (end (point-max)))
  (buffer-substring start end))
</pre></li>
</ul>
</div>
</div>
</div>
